#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_s3_bucket.terraform_state,
  on backend.tf line 1, in resource "aws_s3_bucket" "terraform_state":
   1: resource "aws_s3_bucket" "terraform_state" {

Use the aws_s3_bucket_versioning resource instead

(and 2 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecr_repository.owasp: Refreshing state... [id=owasp]
aws_eip.owasp: Refreshing state... [id=eipalloc-0f07dc02694c02673]
aws_vpc.owasp: Refreshing state... [id=vpc-0df4ab7e8d725331f]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-lock-8c256417-1822-44df-afbd-613c7097c0e9]
data.aws_iam_policy_document.ecs_assume_role_policy: Reading...
aws_ecr_registry_scanning_configuration.test: Refreshing state... [id=018857050180]
aws_s3_bucket.terraform_state: Refreshing state... [id=terraform-state-8c256417-1822-44df-afbd-613c7097c0e9]
data.aws_iam_policy_document.ecs_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=018857050180]
aws_ecr_lifecycle_policy.owasp: Refreshing state... [id=owasp]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=terraform-state-8c256417-1822-44df-afbd-613c7097c0e9]
aws_subnet.public_a: Refreshing state... [id=subnet-09a7941e8cdfa4861]
aws_subnet.private_a: Refreshing state... [id=subnet-0d468d0e9c5d2a139]
aws_internet_gateway.owasp: Refreshing state... [id=igw-012da92f67de6683a]
aws_subnet.public_b: Refreshing state... [id=subnet-04429df0a9982e8ee]
aws_security_group.lb: Refreshing state... [id=sg-0117fece5a6f54106]
aws_subnet.private_b: Refreshing state... [id=subnet-0f8ae7f4ac56e3b5b]
aws_route_table.public: Refreshing state... [id=rtb-0fd9f87bd7dfac635]
aws_route_table_association.public_b: Refreshing state... [id=rtbassoc-003968ab1ba2f06a3]
aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-05838e227913cd311]
aws_nat_gateway.owasp: Refreshing state... [id=nat-0126906a661fa88e1]
aws_security_group.ecs: Refreshing state... [id=sg-0058e59abc626b65f]
aws_route_table.private: Refreshing state... [id=rtb-03c26c44199fb2f69]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-0b406b554e060a547]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-06108a5a58e14a0e6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_allow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_allow" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "https://token.actions.githubusercontent.com",
                ]
              + variable = "token.actions.githubusercontent.com:iss"
            }
          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "token.actions.githubusercontent.com:aud"
            }
          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "repo:juice-shop/juice-shop:*",
                  + "repo:gregsienkiewicz/reimagined-broccoli:*",
                  + "repo:gregsienkiewicz/juice-shop:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_cloudwatch_log_group.owasp will be created
  + resource "aws_cloudwatch_log_group" "owasp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/owasp"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "github" = "reimagined-broccoli"
        }
    }

  # aws_ecs_cluster.owasp will be created
  + resource "aws_ecs_cluster" "owasp" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "owasp"
      + tags_all = {
          + "github" = "reimagined-broccoli"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = (known after apply)
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "/ecs/owasp"
                }
            }
        }
    }

  # aws_ecs_service.owasp will be created
  + resource "aws_ecs_service" "owasp" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "owasp-js"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "github" = "reimagined-broccoli"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "owasp-js"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0058e59abc626b65f",
            ]
          + subnets          = [
              + "subnet-0d468d0e9c5d2a139",
              + "subnet-0f8ae7f4ac56e3b5b",
            ]
        }
    }

  # aws_ecs_task_definition.owasp will be created
  + resource "aws_ecs_task_definition" "owasp" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + healthCheck      = {
                      + command  = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:3000/ || exit 1",
                        ]
                      + interval = 30
                      + retries  = 3
                      + timeout  = 5
                    }
                  + image            = "018857050180.dkr.ecr.us-east-1.amazonaws.com/owasp:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/owasp"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "owasp"
                        }
                    }
                  + name             = "owasp-js"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "owasp"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "github" = "reimagined-broccoli"
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_iam_openid_connect_provider.github_oidc will be created
  + resource "aws_iam_openid_connect_provider" "github_oidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "github" = "reimagined-broccoli"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = "ecsTaskExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "github" = "reimagined-broccoli"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser",
        ]
      + max_session_duration  = 3600
      + name                  = "GitHubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "github" = "reimagined-broccoli"
        }
      + unique_id             = (known after apply)
    }

  # aws_inspector2_enabler.ecr will be created
  + resource "aws_inspector2_enabler" "ecr" {
      + account_ids    = [
          + "018857050180",
        ]
      + id             = (known after apply)
      + resource_types = [
          + "ECR",
        ]
    }

  # aws_kms_key.owasp will be created
  + resource "aws_kms_key" "owasp" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "OWASP ECS Service"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "github" = "reimagined-broccoli"
        }
    }

  # aws_lb.owasp will be created
  + resource "aws_lb" "owasp" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "owasp-lb"
      + name_prefix                                 = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0117fece5a6f54106",
        ]
      + subnets                                     = [
          + "subnet-04429df0a9982e8ee",
          + "subnet-09a7941e8cdfa4861",
        ]
      + tags_all                                    = {
          + "github" = "reimagined-broccoli"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.owasp will be created
  + resource "aws_lb_listener" "owasp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "github" = "reimagined-broccoli"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.owasp will be created
  + resource "aws_lb_target_group" "owasp" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-owasp-lb-ip"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "github" = "reimagined-broccoli"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0df4ab7e8d725331f"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "3000"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-03c26c44199fb2f69"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0126906a661fa88e1"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0126906a661fa88e1"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "OWASP | Private Route Table"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + aws_iam_oidc_github_role = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "key" but a value was found
in file "tfvars/backend.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "workspace_key_prefix" but
a value was found in file "tfvars/backend.tfvars". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Argument is deprecated

  with aws_s3_bucket.terraform_state,
  on backend.tf line 1, in resource "aws_s3_bucket" "terraform_state":
   1: resource "aws_s3_bucket" "terraform_state" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @gregsienkiewicz, Action: `pull_request`, Workflow: `Terraform Plan`*